{
  "backend/main.mo": "Motoko canister storing layout and event logs, with methods to save layouts and emit or query events.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files and component versions.",
  "frontend-file-summaries.txt": "Text file listing short summaries for all frontend project files.",
  "frontend/index.css": "Global Tailwind-based CSS defining OKLCH color variables and dark mode styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component applying theming and rendering the control panel screen with notifications.",
  "frontend/src/components/control-panel/AddControlModal.tsx": "Modal component for configuring and creating new controls with validation and type‑specific settings.",
  "frontend/src/components/control-panel/ControlRenderer.tsx": "Renders each control type with interaction handling and emits signals to the backend.",
  "frontend/src/components/control-panel/CreateControlButton.tsx": "Button that opens the AddControlModal and triggers control creation with full config.",
  "frontend/src/components/control-panel/DragController.tsx": "Wrapper enabling draggable repositioning of controls in edit mode with selection handling.",
  "frontend/src/components/control-panel/ImportExportPanel.tsx": "Provides UI to export the current control layout to JSON or import a layout file, showing errors and success toasts.",
  "frontend/src/components/control-panel/InspectorPanel.tsx": "Displays and edits properties of the selected control, including ID, type, binary codes, and radio options, with validation and delete actions.",
  "frontend/src/components/control-panel/ModeToggle.tsx": "Button that switches between edit and runtime modes using panel mode state.",
  "frontend/src/components/control-panel/RecentSignalsPanel.tsx": "Shows a scrollable list of recently emitted signals with timestamps and a refresh option.",
  "frontend/src/components/control-panel/Workspace.tsx": "Renders all controls in the workspace with drag/edit behavior depending on mode, or a placeholder when empty.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useControlLayout.ts": "Manages local control layout state, syncing with backend, creating/updating/deleting controls, validating IDs, and saving or importing layouts.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities, login/logout, and managing auth status.",
  "frontend/src/hooks/usePanelMode.ts": "Stores and toggles the panel's edit/runtime mode with localStorage persistence.",
  "frontend/src/hooks/useRecentSignals.ts": "Fetches recent backend events on an interval and exposes loading and refresh utilities.",
  "frontend/src/hooks/useSignalEmitter.ts": "Offers a mutation to emit signals to the backend and refreshes recent events on success.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables, dark mode values, global styles, and custom scrollbar rules.",
  "frontend/src/lib/binaryCode.ts": "Validates binary strings and deterministically generates an 8‑bit binary code from a seed.",
  "frontend/src/lib/controlDefaults.ts": "Provides default configuration objects for each control type when creating new controls.",
  "frontend/src/lib/download.ts": "Implements a helper to download arbitrary data as a JSON file in the browser.",
  "frontend/src/lib/layoutSerialization.ts": "Validates layout JSON, checks control fields and binary codes, and provides import/export helpers.",
  "frontend/src/lib/utils.ts": "Exposes a utility for merging Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and loads global styles.",
  "frontend/src/screens/ControlPanelScreen.tsx": "Renders the main control panel UI with header, workspace, inspector, signals panel, and footer.",
  "frontend/src/types/controlPanel.ts": "Defines TypeScript types for control configs, radio options, and layout structures.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors using CSS variables, custom animations, and plugin integrations.",
  "project_state.json": "Describes project state, goals, architecture notes, known issues, and tracked feature requirements."
}