{
  "backend/main.mo": "Motoko backend defining layouts, controls, and event logging with validation and CRUD query/update methods.",
  "feature_evidence.json": "JSON report listing implemented frontend features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend source files.",
  "frontend/index.css": "Tailwind-based global stylesheet defining theme variables, fullscreen behavior, and custom scrollbars.",
  "frontend/index.html": "HTML entry point setting up the root element and loading the main React script.",
  "frontend/src/App.tsx": "Root React component applying theming and rendering the control panel screen and toaster.",
  "frontend/src/components/control-panel/AddControlModal.tsx": "Modal UI for creating new controls with configuration fields, validation, and radio/slider support.",
  "frontend/src/components/control-panel/ControlLayoutProvider.tsx": "React context provider managing control layout state, syncing with backend, and handling save/create operations.",
  "frontend/src/components/control-panel/ControlRenderer.tsx": "Renders different control types (button, toggle, slider, radio) and emits signals on interaction, handling edit mode restrictions and local state.",
  "frontend/src/components/control-panel/CreateControlButton.tsx": "Displays an Add Control button with tooltip and modal handling, disabled unless in edit mode and layout is ready.",
  "frontend/src/components/control-panel/DragController.tsx": "Wraps a control with draggable behavior in edit mode, updating its position based on mouse movement.",
  "frontend/src/components/control-panel/FullscreenToggleButton.tsx": "Provides a button to toggle browser fullscreen mode with error handling and dynamic icons.",
  "frontend/src/components/control-panel/ImportExportPanel.tsx": "Enables importing and exporting of control panel layouts, validating files and showing errors during import.",
  "frontend/src/components/control-panel/InspectorPanel.tsx": "Shows editable properties for the selected control, including ID, type, binary code, and radio options with validation.",
  "frontend/src/components/control-panel/ModeToggle.tsx": "Toggles between edit and interact modes with a button and icon change.",
  "frontend/src/components/control-panel/RecentSignalsPanel.tsx": "Displays a scrollable list of recently emitted signals with timestamp formatting and refresh support.",
  "frontend/src/components/control-panel/SharedAddControlButton.tsx": "Empty placeholder file for a shared Add Control button component.",
  "frontend/src/components/control-panel/UserExtensionsSection.tsx": "Provides a card section for users to add custom React code or extensions.",
  "frontend/src/components/control-panel/Workspace.tsx": "Renders the workspace containing all controls, supporting selection and dragging in edit mode and clearing selection in interact mode.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current identity and invalidates related queries when it changes.",
  "frontend/src/hooks/useControlLayout.ts": "Provides context access for control layout state, including selection, creation, updates, deletion, and layout persistence.",
  "frontend/src/hooks/useFullscreen.ts": "Manages fullscreen state for a given element with cross-browser API handling and enter/exit/toggle helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity auth setup, login flow, stored identity restoration, and exposes identity state via context.",
  "frontend/src/hooks/usePanelMode.ts": "Implements a shared edit/interact mode using a module-level store synced with localStorage.",
  "frontend/src/hooks/useRecentSignals.ts": "Fetches recent backend events via an actor, polling periodically and exposing event data and loading state.",
  "frontend/src/hooks/useSignalEmitter.ts": "Provides a mutation for emitting control events to the backend and invalidates recentEvents on success.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, fullscreen styles, sliders, scrollbars, and control panel visual rules.",
  "frontend/src/lib/binaryCode.ts": "Validates 4-bit binary codes and generates deterministic default codes from string seeds.",
  "frontend/src/lib/controlDefaults.ts": "Returns default config values for each control type including sliders, toggles, buttons, and radio groups.",
  "frontend/src/lib/download.ts": "Triggers a JSON file download by creating a blob and temporary link element.",
  "frontend/src/lib/layoutSerialization.ts": "Validates layout objects for control panels and provides JSON import/export helpers.",
  "frontend/src/lib/safeBrowser.ts": "Offers safe wrappers around browser APIs like localStorage, hostname, and fullscreen checks.",
  "frontend/src/lib/utils.ts": "Provides a utility for merging class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/screens/ControlPanelScreen.tsx": "Renders the main control panel UI with workspace, side panels, mode switching, and fullscreen support.",
  "frontend/src/types/controlPanel.ts": "Defines TypeScript types for control panel layouts and control configurations.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Stores project metadata, feature status, and scaffold-related feature requests."
}