{
  "backend/main.mo": "Motoko canister storing a layout and event log, with methods to save layouts, emit events, and query events or controls.",
  "feature_evidence.json": "Feature evidence metadata describing two frontend features, their related files, components, and test IDs.",
  "frontend-file-summaries.txt": "A map of frontend file paths to short descriptions explaining each file’s purpose within the control panel system.",
  "frontend/index.css": "Tailwind base styles plus dark/light theme CSS variables and global styling rules.",
  "frontend/index.html": "HTML entry point defining the root element and loading the main React script.",
  "frontend/src/App.tsx": "Root React component applying theming and rendering the ControlPanelScreen with a Toaster.",
  "frontend/src/components/control-panel/AddControlModal.tsx": "Modal for creating new controls with validation and dynamic fields based on control type.",
  "frontend/src/components/control-panel/ControlLayoutProvider.tsx": "React context provider managing shared control layout state, syncing with the backend, and exposing CRUD operations.",
  "frontend/src/components/control-panel/ControlRenderer.tsx": "Renders interactive controls (button, toggle, slider, radio) and emits signals or updates state when used, with behavior changing based on edit mode.",
  "frontend/src/components/control-panel/CreateControlButton.tsx": "Provides a button to open a modal for creating new controls and passes creation and ID validation logic.",
  "frontend/src/components/control-panel/DragController.tsx": "Wraps a control with draggable behavior in edit mode, updating its position during drag operations.",
  "frontend/src/components/control-panel/ImportExportPanel.tsx": "Enables exporting the current layout to JSON and importing layouts from files with error handling.",
  "frontend/src/components/control-panel/InspectorPanel.tsx": "Displays and edits properties of the selected control, including ID, type, binary code, and radio options.",
  "frontend/src/components/control-panel/ModeToggle.tsx": "Toggles between edit and runtime modes with a button.",
  "frontend/src/components/control-panel/RecentSignalsPanel.tsx": "Shows recently emitted signals with timestamps and provides a refresh button.",
  "frontend/src/components/control-panel/Workspace.tsx": "Renders the workspace canvas, placing controls with drag behavior in edit mode and showing an empty-state message when none exist.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useControlLayout.ts": "Provides context accessors for managing control layout state, including CRUD operations, validation, saving, and layout import.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, exposing identity state, login, and logout helpers.",
  "frontend/src/hooks/usePanelMode.ts": "Manages panel mode (edit/runtime) with localStorage persistence and a toggle function.",
  "frontend/src/hooks/useRecentSignals.ts": "Fetches recent events from the backend actor with polling using React Query.",
  "frontend/src/hooks/useSignalEmitter.ts": "Provides a mutation to emit control signals to the backend and refresh recent events.",
  "frontend/src/index.css": "Defines global Tailwind CSS styles, theme variables, dark mode rules, and custom scrollbar and control styles.",
  "frontend/src/lib/binaryCode.ts": "Validates binary strings and generates deterministic 8‑bit binary codes from seeds.",
  "frontend/src/lib/controlDefaults.ts": "Generates default configuration values for different control types.",
  "frontend/src/lib/download.ts": "Utility to download arbitrary data as a JSON file.",
  "frontend/src/lib/layoutSerialization.ts": "Validates, imports, and exports control panel layout JSON structures.",
  "frontend/src/lib/utils.ts": "Provides a class name merging helper using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/screens/ControlPanelScreen.tsx": "Renders the main control panel UI with workspace, inspector, recent signals, and import/export panels.",
  "frontend/src/types/controlPanel.ts": "Defines TypeScript types for control configurations and layout structures.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins.",
  "project_state.json": "Tracks project metadata, existing features, and pending requests related to synchronizing control creation with workspace rendering."
}