{
  "backend/main.mo": "Motoko actor storing a control layout and capped event log, with methods to save layouts and emit or query events.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend components, hooks, and utilities in the control panel app.",
  "frontend/index.css": "Global Tailwind-based styles defining theme variables, fullscreen workspace rules, scrollbars, and control-panel-specific classes.",
  "frontend/index.html": "Base HTML document loading the React app with a dark theme root and mounting point.",
  "frontend/src/App.tsx": "Root component applying dark theme and rendering the control panel screen with a toaster.",
  "frontend/src/components/control-panel/AddControlModal.tsx": "Modal UI for creating new controls with validation, type‑specific settings, and automatic default values.",
  "frontend/src/components/control-panel/ControlLayoutProvider.tsx": "Context provider managing control layout state, syncing with the backend, and exposing CRUD operations.",
  "frontend/src/components/control-panel/ControlRenderer.tsx": "Renders different control types (button, toggle, slider, radio) and emits signal events, managing local interaction states unless in edit mode.",
  "frontend/src/components/control-panel/CreateControlButton.tsx": "Simple wrapper that renders the shared add-control button.",
  "frontend/src/components/control-panel/DragController.tsx": "Wraps a control with draggable positioning logic in edit mode and updates layout during drag.",
  "frontend/src/components/control-panel/FullscreenToggleButton.tsx": "Toggles fullscreen mode for the workspace and handles unsupported or failed attempts with toasts.",
  "frontend/src/components/control-panel/ImportExportPanel.tsx": "Provides UI to export or import control layouts, showing errors and using file input processing.",
  "frontend/src/components/control-panel/InspectorPanel.tsx": "Displays and updates properties of the selected control, including ID, type, label, and radio options.",
  "frontend/src/components/control-panel/ModeToggle.tsx": "Switches between edit mode and runtime mode with a styled button.",
  "frontend/src/components/control-panel/RecentSignalsPanel.tsx": "Shows a scrollable list of recently emitted signals with refresh support.",
  "frontend/src/components/control-panel/SharedAddControlButton.tsx": "Add-control button with modal handling and tooltips explaining disabled states based on panel mode and initialization.",
  "frontend/src/components/control-panel/Workspace.tsx": "Renders the workspace containing draggable controls and selects them in edit mode, showing a placeholder when empty.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useControlLayout.ts": "Provides context access to control layout state and operations like selecting, creating, updating, deleting, and saving controls.",
  "frontend/src/hooks/useFullscreen.ts": "Manages fullscreen mode for a referenced element with cross-browser support and exposes enter, exit, and toggle functions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, providing login, logout, and identity retrieval via context.",
  "frontend/src/hooks/usePanelMode.ts": "Stores and toggles panel mode between edit and runtime, persisting the value in localStorage.",
  "frontend/src/hooks/useRecentSignals.ts": "Fetches recent events from the backend actor on a polling interval and returns them with loading and refetch helpers.",
  "frontend/src/hooks/useSignalEmitter.ts": "Provides a mutation for emitting control events to the backend and invalidates recent events on success.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables, global styles, control-specific styles, fullscreen styles, and custom scrollbars.",
  "frontend/src/lib/binaryCode.ts": "Validates binary strings and generates deterministic 8‑bit binary codes from a string seed.",
  "frontend/src/lib/controlDefaults.ts": "Provides default configuration values for different control types when creating new controls.",
  "frontend/src/lib/download.ts": "Triggers a JSON file download by creating a blob and temporary link element.",
  "frontend/src/lib/layoutSerialization.ts": "Validates, exports, and imports control layout JSON, including binary code checks and ID uniqueness.",
  "frontend/src/lib/safeBrowser.ts": "Provides safe wrappers for browser APIs like localStorage, hostname, and fullscreen checks to avoid runtime errors.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/screens/ControlPanelScreen.tsx": "Renders the main control panel layout including workspace, inspector, signals, and UI controls with mode-dependent sidebars.",
  "frontend/src/types/controlPanel.ts": "Defines TypeScript types for control configurations, including buttons, toggles, sliders, and radio groups.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins such as typography and container queries.",
  "project_state.json": "Describes the project state, including existing features, new feature requests, and metadata."
}