{
  "backend/main.mo": "Motoko canister storing UI control layout and an event log, with strict 4‑bit binary code validation and queries/mutations for layout and event retrieval.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs for binary‑code and UI‑validation updates.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all frontend files involved in control panel UI, hooks, utilities, and layout logic.",
  "frontend/index.css": "Global Tailwind CSS setup defining theme variables, dark‑mode styles, fullscreen workspace rules, and custom scrollbars.",
  "frontend/index.html": "Base HTML document loading the React app root and main module script.",
  "frontend/src/App.tsx": "Wraps the ControlPanelScreen in a dark‑theme provider with global notifications.",
  "frontend/src/components/control-panel/AddControlModal.tsx": "Modal for creating new controls with 4‑bit binary code validation, type‑specific config fields, and radio option management.",
  "frontend/src/components/control-panel/ControlLayoutProvider.tsx": "Provider managing control layout state, backend sync, full layout validation, and CRUD operations including 4‑bit binary enforcement.",
  "frontend/src/components/control-panel/ControlRenderer.tsx": "Renders various control types (button, toggle, slider, radio) with interactive behavior and emits signals unless in edit mode.",
  "frontend/src/components/control-panel/CreateControlButton.tsx": "Provides a button to open the add‑control modal, handling loading, edit‑mode restrictions, and tooltips.",
  "frontend/src/components/control-panel/DragController.tsx": "Enables dragging and selecting controls in edit mode, updating their position in layout state.",
  "frontend/src/components/control-panel/FullscreenToggleButton.tsx": "Toggles fullscreen mode with success/error handling and hides itself if unsupported.",
  "frontend/src/components/control-panel/ImportExportPanel.tsx": "Allows exporting the current layout to JSON and importing a layout file with validation and error display.",
  "frontend/src/components/control-panel/InspectorPanel.tsx": "Provides an editor for the selected control’s properties, including ID, type, binary code, and radio options.",
  "frontend/src/components/control-panel/ModeToggle.tsx": "Switches between edit and interact modes with a single button.",
  "frontend/src/components/control-panel/RecentSignalsPanel.tsx": "Displays a scrollable list of recently emitted signals with refresh support.",
  "frontend/src/components/control-panel/SharedAddControlButton.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/control-panel/Workspace.tsx": "Renders and manages the interactive canvas of controls, including selection and drag behavior depending on mode.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useControlLayout.ts": "Provides a React context and hook for managing control layout state, including selection, creation, updates, deletion, and layout persistence.",
  "frontend/src/hooks/useFullscreen.ts": "Implements a fullscreen control hook that syncs state, detects support, and exposes enter, exit, and toggle functions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Creates an Internet Identity auth context with login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/usePanelMode.ts": "Manages global edit/interact panel mode using a shared store synchronized with localStorage.",
  "frontend/src/hooks/useRecentSignals.ts": "Fetches recent backend events via React Query, polling periodically and exposing loading and refetch controls.",
  "frontend/src/hooks/useSignalEmitter.ts": "Provides a mutation to emit control interaction events to the backend and invalidate recent event queries.",
  "frontend/src/index.css": "Defines Tailwind-based global styles, theme variables, control panel styles, fullscreen behavior, and custom scrollbars.",
  "frontend/src/lib/binaryCode.ts": "Validates 4‑bit binary codes and generates deterministic default codes from string seeds.",
  "frontend/src/lib/controlDefaults.ts": "Generates default control configuration objects based on control type.",
  "frontend/src/lib/download.ts": "Creates and triggers a JSON file download from provided data.",
  "frontend/src/lib/layoutSerialization.ts": "Validates layout structures, exports them to JSON, and imports them with error reporting.",
  "frontend/src/lib/safeBrowser.ts": "Provides safe wrappers for browser APIs like localStorage, hostname access, and fullscreen detection to avoid runtime errors.",
  "frontend/src/lib/utils.ts": "Defines a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and the Internet Identity provider before rendering App.",
  "frontend/src/screens/ControlPanelScreen.tsx": "Renders the main control panel UI with edit and interact modes, workspace layout, side panels, fullscreen support, and footer attribution.",
  "frontend/src/types/controlPanel.ts": "Defines TypeScript types for control panel elements, including control configs, radio options, and layout structure.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, animations, container settings, and plugins like typography and container queries.",
  "project_state.json": "Describes project state, existing features, and pending requests focused on enforcing 4‑bit binary code constraints across the system."
}