{
  "backend/main.mo": "Motoko canister managing control layouts and event logs, with validation and decimal-to-binary helpers.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend source files for reference or tooling.",
  "frontend/docs/linux-local-test-bundle.md": "Guide for running the Linux test bundle with prerequisites, extraction steps, and usage instructions.",
  "frontend/docs/rpi-bash-runner.md": "Documentation for the Raspberry Pi event runner script that polls events and executes gpioset commands.",
  "frontend/docs/rpi-bash-runner.md.backup": "Empty backup placeholder for the rpi-bash-runner documentation.",
  "frontend/index.css": "Tailwind-based global styles defining theme variables, fullscreen behavior, and custom scrollbars.",
  "frontend/index.html": "Base HTML file loading the React application root and main script.",
  "frontend/scripts/lib/script_diagnostics.sh": "Bash helper providing structured logging and diagnostics for script execution.",
  "frontend/scripts/linux_bundle_run.sh": "Launcher script for starting, stopping, and cleaning the local IC replica in the Linux bundle.",
  "frontend/scripts/package_linux_bundle.sh": "Packages the built frontend, backend canister artifacts, and helper scripts into a timestamped Linux .tar.gz archive with dependency checks and build steps.",
  "frontend/scripts/rpi_event_runner.sh": "Polls a backend canister for events and executes validated GPIO commands on a Raspberry Pi, with state tracking and dry‑run support.",
  "frontend/scripts/rpi_pin_test.sh": "Interactive or automated GPIO pin tester for Raspberry Pi, toggling specific pins to verify wiring, with optional dry‑run mode.",
  "frontend/src/App.tsx": "Root React component that wraps the control panel UI in a dark theme and includes the toaster for notifications.",
  "frontend/src/components/control-panel/AddControlModal.tsx": "Modal UI for creating new controls, handling control types, validation, binary/decimal code logic, and form state setup.",
  "frontend/src/components/control-panel/ControlLayoutProvider.tsx": "Provider that loads, manages, validates, and saves the control layout via backend actor calls, exposing layout state through context.",
  "frontend/src/components/control-panel/ControlRenderer.tsx": "Renders and handles interaction logic for various control types, including buttons, toggles, sliders, radios, and dials with GPIO command emission. Manages local state, input events, validation, and HTTP posts tied to control actions.",
  "frontend/src/components/control-panel/CreateControlButton.tsx": "Displays a button to open the add‑control modal, enabling it only in edit mode. Shows tooltips and loading states based on layout initialization.",
  "frontend/src/components/control-panel/DragController.tsx": "Wraps controls with draggable behavior in edit mode and updates their position during drag. Also manages selection and visual highlighting.",
  "frontend/src/components/control-panel/FullscreenToggleButton.tsx": "Toggles browser fullscreen mode with error handling and visual state indication. Renders nothing if fullscreen isn't supported.",
  "frontend/src/components/control-panel/ImportExportPanel.tsx": "Provides UI to export the current layout to JSON or import a saved layout with validation. Shows import errors and uses file input and toasts for user feedback.",
  "frontend/src/components/control-panel/InspectorPanel.tsx": "Allows editing of the selected control’s properties, including ID, position, size, type, and binary codes. Syncs form state with selection and applies updates or deletions.",
  "frontend/src/components/control-panel/ModeToggle.tsx": "Switches between edit and interact modes with a simple button UI. Updates styling and icons based on the current mode.",
  "frontend/src/components/control-panel/RecentSignalsPanel.tsx": "Displays recently emitted control signals with timestamps and metadata. Supports manual refresh and scrollable history.",
  "frontend/src/components/control-panel/SharedAddControlButton.tsx": "Empty placeholder file with no implemented logic.",
  "frontend/src/components/control-panel/UserExtensionsSection.tsx": "Provides a reserved section for custom user-defined UI or logic within a styled card. Includes placeholder content and guidance comments.",
  "frontend/src/components/control-panel/Workspace.tsx": "Renders the full workspace containing all controls, enabling dragging and selection in edit mode. Clears selection when switching to interact mode and shows an empty‑state message when no controls exist.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useControlLayout.ts": "Provides context and accessors for managing control layout state, including selection, creation, updates, and saving.",
  "frontend/src/hooks/useFullscreen.ts": "Manages fullscreen state for a given element with cross‑browser support and helpers to enter, exit, and toggle fullscreen.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity authentication, loading stored identities, login state, and exposes identity through context.",
  "frontend/src/hooks/usePanelMode.ts": "Stores and syncs a global edit/interact mode using localStorage and an external store subscription.",
  "frontend/src/hooks/useRecentSignals.ts": "Polls the backend actor for recent events every two seconds and exposes the event list and loading state.",
  "frontend/src/hooks/useSignalEmitter.ts": "Emits control interaction events to the backend and invalidates recent event queries on success.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode, control panel styling, fullscreen rules, and custom scrollbars.",
  "frontend/src/lib/binaryCode.ts": "Validates 4‑bit binary codes and generates deterministic default codes from a string seed.",
  "frontend/src/lib/buttonCode.ts": "Converts between decimal (1–16) and 4‑bit binary codes and provides validation utilities.",
  "frontend/src/lib/controlDefaults.ts": "Provides default configuration templates for different control types like buttons, toggles, sliders, radios, and dials.",
  "frontend/src/lib/download.ts": "Triggers a JSON file download by generating a Blob and simulating a link click.",
  "frontend/src/lib/gpioHttp.ts": "Sends a POST request to localhost:3000/gpio with a 4-bit binary payload and logs failures.",
  "frontend/src/lib/gpiosetCommands.ts": "Generates gpioset command strings from 4‑bit codes and provides a helper for single button press/release commands.",
  "frontend/src/lib/layoutSerialization.ts": "Validates control panel layout objects and provides JSON import/export with error reporting.",
  "frontend/src/lib/safeBrowser.ts": "Provides safe wrappers for browser APIs like localStorage, hostname retrieval, and fullscreen checks.",
  "frontend/src/lib/utils.ts": "Exports a utility to merge Tailwind and clsx class names.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/screens/ControlPanelScreen.tsx": "Renders the main control panel UI with workspace, side panels, mode controls, and fullscreen support.",
  "frontend/src/types/controlPanel.ts": "Defines TypeScript types for control panel layouts and control configurations.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, plugins, and design tokens.",
  "project_state.json": "Stores project metadata, requirements, and feature request tracking for GPIO command behavior."
}