{
  "backend/main.mo": "Defines the canister actor for storing layouts and logging events with control names, providing APIs to save layouts and query events.",
  "backend/migration.mo": "Migrates old layout and event data to new types by adding optional controlName fields.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend files for reference.",
  "frontend/index.css": "Global Tailwind-based styles including theme variables, fullscreen workspace rules, and custom scrollbars.",
  "frontend/index.html": "HTML entry point loading the React app root and main script.",
  "frontend/src/App.tsx": "Root React app that applies theming and renders the control panel screen with a toaster.",
  "frontend/src/components/control-panel/AddControlModal.tsx": "Modal UI for creating new controls with type-specific settings, validation, and default values.",
  "frontend/src/components/control-panel/ControlLayoutProvider.tsx": "Context provider managing control layout state, backend sync, creation, updates, and persistence.",
  "frontend/src/components/control-panel/ControlRenderer.tsx": "Renders different control types (button, toggle, slider, radio) and emits signals or updates state based on user interaction unless in edit mode.",
  "frontend/src/components/control-panel/CreateControlButton.tsx": "Displays an Add Control button that opens a modal only when layout is initialized and in edit mode, with disabled-state tooltips.",
  "frontend/src/components/control-panel/DragController.tsx": "Wraps a control with draggable positioning logic in edit mode and updates its coordinates during drag.",
  "frontend/src/components/control-panel/FullscreenToggleButton.tsx": "Provides a button to enter or exit fullscreen for a workspace element, showing errors via toast if unsupported or failed.",
  "frontend/src/components/control-panel/ImportExportPanel.tsx": "Handles exporting controls layout to JSON and importing a layout file, showing validation errors and applying imported data.",
  "frontend/src/components/control-panel/InspectorPanel.tsx": "Displays editable properties for the selected control, including ID, type, label, and radio options, with validation and update logic.",
  "frontend/src/components/control-panel/ModeToggle.tsx": "Toggles between edit and runtime modes with a button that reflects the current mode.",
  "frontend/src/components/control-panel/RecentSignalsPanel.tsx": "Shows a scrollable list of recently emitted signals with timestamps and allows manual refresh.",
  "frontend/src/components/control-panel/Workspace.tsx": "Renders all controls in a positioned workspace, enabling selection and dragging in edit mode and showing a placeholder when empty.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates related queries when the identity changes.",
  "frontend/src/hooks/useControlLayout.ts": "Provides a React context and hook for accessing and modifying control layout state, including CRUD operations and layout persistence.",
  "frontend/src/hooks/useFullscreen.ts": "Implements a fullscreen management hook that tracks support, state, and provides enter, exit, and toggle functions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines context and provider for Internet Identity authentication, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/usePanelMode.ts": "Manages an edit/runtime mode state with persistence in localStorage and a toggle helper.",
  "frontend/src/hooks/useRecentSignals.ts": "Fetches recent events from the backend actor using react-query with periodic polling.",
  "frontend/src/hooks/useSignalEmitter.ts": "Provides a mutation to emit control signals via the backend actor and refresh recent events on success.",
  "frontend/src/index.css": "Defines global Tailwind-based styles, theme variables, fullscreen rules, control panel styles, and custom scrollbars.",
  "frontend/src/lib/binaryCode.ts": "Validates binary strings and generates deterministic 8‑bit binary codes from a seed string.",
  "frontend/src/lib/controlDefaults.ts": "Provides default configuration values for each control type when creating new controls.",
  "frontend/src/lib/download.ts": "Utility to download JSON data as a file using a generated Blob and temporary link.",
  "frontend/src/lib/layoutSerialization.ts": "Validates, imports, and exports layout configurations, including control field checks and binary code validation.",
  "frontend/src/lib/utils.ts": "Exports a helper to merge class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with react-query and Internet Identity providers.",
  "frontend/src/screens/ControlPanelScreen.tsx": "Renders the main control panel layout including header, workspace, side panels, and footer, adapting sidebars based on edit mode.",
  "frontend/src/types/controlPanel.ts": "Defines TypeScript types for control configurations, including buttons, toggles, sliders, and radio groups used in the control panel.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, feature requirements, and state related to runtime button interactions and event logging."
}