{
  "backend/main.mo": "Motoko canister managing control layouts and emitting validated 4‑bit binary event logs, with queries for recent and filtered events.",
  "feature_evidence.json": "Feature evidence report mapping UI GPIO behaviors to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text listing concise summaries for many frontend source files and their roles.",
  "frontend/docs/linux-local-test-bundle.md": "Guide for running the Linux test bundle including prerequisites, extraction, and startup steps.",
  "frontend/docs/rpi-bash-runner.md": "Instructions for using a Raspberry Pi script that polls backend events and executes GPIO commands.",
  "frontend/docs/rpi-bash-runner.md.backup": "Empty backup file placeholder for the rpi-bash-runner documentation.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining theme variables, control panel styles, fullscreen behavior, and custom scrollbars.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx with a dark theme root.",
  "frontend/scripts/lib/script_diagnostics.sh": "Bash helper providing colored logging and detailed diagnostics for build or deploy step failures.",
  "frontend/scripts/linux_bundle_run.sh": "Launches a local IC replica, deploys the app, and provides stop/clean commands with logging and failure diagnostics.",
  "frontend/scripts/package_linux_bundle.sh": "Builds backend and frontend, collects artifacts, and packages a distributable Linux test bundle with dependency checks and diagnostics.",
  "frontend/scripts/rpi_event_runner.sh": "Polls the backend canister for GPIO event commands and executes them on a Raspberry Pi with state tracking and dry‑run support.",
  "frontend/scripts/rpi_pin_test.sh": "Tests Raspberry Pi GPIO pins by toggling configured outputs interactively or automatically with optional dry‑run mode.",
  "frontend/src/App.tsx": "Root React component setting up theming and rendering the ControlPanelScreen with a global toaster.",
  "frontend/src/components/control-panel/AddControlModal.tsx": "Modal UI for creating new controls with validation, type‑specific config handling, and automatic default initialization.",
  "frontend/src/components/control-panel/ControlLayoutProvider.tsx": "Manages loading, syncing, validating, and saving control layout data using React Query and local state. Provides layout context, control creation, and error-handled save operations.",
  "frontend/src/components/control-panel/ControlRenderer.tsx": "Renders and handles interaction logic for individual controls, including button presses, toggles, sliders, radios, and GPIO signal emission. Validates binary codes and sends HTTP and gpioset commands.",
  "frontend/src/components/control-panel/CreateControlButton.tsx": "Displays an Add Control button that opens a modal when in edit mode, with tooltips and loading states. Disables interaction when layout is not ready or mode is not edit.",
  "frontend/src/components/control-panel/DragController.tsx": "Wraps a control with drag-and-drop positioning behavior when editing. Updates control coordinates while preventing dragging in interact mode.",
  "frontend/src/components/control-panel/FullscreenToggleButton.tsx": "Provides a button to enter or exit fullscreen mode with error-handling and visual state changes. Hides itself if fullscreen is unsupported.",
  "frontend/src/components/control-panel/ImportExportPanel.tsx": "Allows exporting the current layout to JSON and importing layout files with validation. Shows errors and updates layout when imports succeed.",
  "frontend/src/components/control-panel/InspectorPanel.tsx": "Displays editable properties for the selected control and syncs changes back to layout state. Supports updating IDs, binary codes, dimensions, types, and radio/dial settings.",
  "frontend/src/components/control-panel/ModeToggle.tsx": "Toggles between edit and interact modes with a button indicating the current mode.",
  "frontend/src/components/control-panel/RecentSignalsPanel.tsx": "Displays a scrollable list of recent emitted signals with timestamps and allows manual refresh.",
  "frontend/src/components/control-panel/SharedAddControlButton.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/control-panel/UserExtensionsSection.tsx": "Provides a card section where users can add custom React components or extensions.",
  "frontend/src/components/control-panel/Workspace.tsx": "Renders the control workspace with draggable controls and handles selection based on edit/interact mode.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useControlLayout.ts": "Context hook exposing control layout state, CRUD operations, validation, and layout import/export.",
  "frontend/src/hooks/useFullscreen.ts": "Hook for entering, exiting, and toggling fullscreen mode for a DOM element with cross-browser support.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout actions, and identity persistence.",
  "frontend/src/hooks/usePanelMode.ts": "Global store hook managing edit/interact panel mode with localStorage persistence.",
  "frontend/src/hooks/useRecentSignals.ts": "Fetches recent backend events, polling every 2 seconds using the actor API.",
  "frontend/src/hooks/useSignalEmitter.ts": "Provides a mutation for emitting control events to the backend and invalidates recent event queries.",
  "frontend/src/index.css": "Global Tailwind styles defining theme variables, control panel styling, fullscreen rules, and custom scrollbars.",
  "frontend/src/lib/binaryCode.ts": "Validates 4‑bit binary strings and generates deterministic 4‑bit codes from a seed.",
  "frontend/src/lib/controlDefaults.ts": "Provides default configuration objects for each control type excluding id and binaryCode fields.",
  "frontend/src/lib/download.ts": "Triggers a browser download of provided data as a JSON file.",
  "frontend/src/lib/gpioHttp.ts": "Sends 4‑bit binary codes to a local /gpio endpoint via HTTP POST with warning‑based error handling.",
  "frontend/src/lib/gpiosetCommands.ts": "Converts a 4‑bit binary code into gpioset command strings and sequences for Raspberry Pi GPIO pins.",
  "frontend/src/lib/layoutSerialization.ts": "Validates layout structures, exports them to JSON, and imports them with error reporting.",
  "frontend/src/lib/safeBrowser.ts": "Provides safe wrappers for browser APIs like localStorage, hostname, and fullscreen detection.",
  "frontend/src/lib/utils.ts": "Utility function for merging class names using clsx and tailwind‑merge.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider.",
  "frontend/src/screens/ControlPanelScreen.tsx": "Renders the main control panel UI including workspace, side panels, mode controls, and fullscreen handling.",
  "frontend/src/types/controlPanel.ts": "Defines TypeScript types for control configurations and layout structures.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with extended colors, animations, and plugins.",
  "project_state.json": "Describes project metadata, requirements, and feature tracking for GPIO POST interactions."
}