{
  "backend/main.mo": "Motoko actor storing control layout and event log, allowing layout retrieval, updates, and event emission with size-limited history.",
  "feature_evidence.json": "Feature evidence report listing two add-control-button UX features with associated files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of many frontend files for reference or documentation.",
  "frontend/index.css": "Tailwind-based global styles defining color variables, dark mode, control panel visuals, fullscreen workspace, and scrollbar appearance.",
  "frontend/index.html": "HTML entry point setting up dark theme root and loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component applying theme provider and rendering the control panel screen with notifications.",
  "frontend/src/components/control-panel/AddControlModal.tsx": "Modal UI for creating new controls with validation, defaults, radio/slider settings, and layout injection.",
  "frontend/src/components/control-panel/ControlLayoutProvider.tsx": "Provider managing control layout state, syncing with backend, and exposing CRUD operations including controlled initialization.",
  "frontend/src/components/control-panel/ControlRenderer.tsx": "Renders different control types (button, toggle, slider, radio) and emits signals or updates layout based on interactions. Handles edit-mode restrictions and visual states.",
  "frontend/src/components/control-panel/CreateControlButton.tsx": "Thin wrapper that renders the shared add‑control button component.",
  "frontend/src/components/control-panel/DragController.tsx": "Provides draggable positioning for controls in edit mode and updates their coordinates during drag events. Also shows selection borders when active.",
  "frontend/src/components/control-panel/FullscreenToggleButton.tsx": "Toggles fullscreen mode for the workspace with error handling and visual state icons. Hides itself if fullscreen is unsupported.",
  "frontend/src/components/control-panel/ImportExportPanel.tsx": "Allows exporting the current layout to JSON and importing layouts with validation and error display. Includes version‑management UI elements.",
  "frontend/src/components/control-panel/InspectorPanel.tsx": "Displays and edits properties of the selected control, including ID, label, type, and radio options, with validation and layout‑saving actions.",
  "frontend/src/components/control-panel/ModeToggle.tsx": "Switches between edit mode and runtime mode with a button showing corresponding icons and styles.",
  "frontend/src/components/control-panel/RecentSignalsPanel.tsx": "Shows a scrollable list of recently emitted signals with timestamps and metadata, with manual refresh capability.",
  "frontend/src/components/control-panel/SharedAddControlButton.tsx": "Button for adding new controls with mode and initialization gating, tooltip explanations, and modal launch behavior.",
  "frontend/src/components/control-panel/Workspace.tsx": "Main canvas rendering all controls inside draggable wrappers depending on mode, with empty‑state messaging when no controls exist.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useControlLayout.ts": "Provides a context hook for managing control layout state, selection, updates, creation, deletion, and validation.",
  "frontend/src/hooks/useFullscreen.ts": "Manages fullscreen state for a referenced element with enter, exit, and toggle helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, stored identities, and status tracking.",
  "frontend/src/hooks/usePanelMode.ts": "Stores and toggles edit/runtime panel mode with persistence to local storage.",
  "frontend/src/hooks/useRecentSignals.ts": "Fetches and polls recent backend events using the actor, updating every 5 seconds.",
  "frontend/src/hooks/useSignalEmitter.ts": "Emits control events via the actor and refreshes recent events on success while handling errors.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, fullscreen styles, and custom scrollbars.",
  "frontend/src/lib/binaryCode.ts": "Validates binary strings and generates deterministic 8‑bit codes from seeds.",
  "frontend/src/lib/controlDefaults.ts": "Provides default configuration values for each control type.",
  "frontend/src/lib/download.ts": "Creates and triggers a download of arbitrary data as a JSON file.",
  "frontend/src/lib/layoutSerialization.ts": "Validates, exports, and imports control layout JSON, including detailed field checks.",
  "frontend/src/lib/safeBrowser.ts": "Provides safe wrappers for browser APIs like localStorage, hostname access, and fullscreen detection to avoid errors in non-browser contexts.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entry point that sets up React rendering with QueryClient and InternetIdentityProvider.",
  "frontend/src/screens/ControlPanelScreen.tsx": "Defines the main control panel UI layout with header, workspace, side panels, and footer, including mode-dependent rendering.",
  "frontend/src/types/controlPanel.ts": "Contains TypeScript types for control panel layout, including control configurations and layout structure.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing features, issues, and versioning related to restoring Add Control button behavior."
}