{
  "backend/main.mo": "Implements the backend actor for managing control layouts, validating 4-bit binary codes, logging events, and generating gpioset command sequences.",
  "backend/migration.mo": "Provides a no-op migration that returns old actor state unchanged.",
  "feature_evidence.json": "Lists feature evidence metadata mapping features to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend source files for reference or tooling.",
  "frontend/docs/linux-local-test-bundle.md": "Documentation describing how to run the Linux test bundle, including prerequisites, extraction, and usage steps.",
  "frontend/docs/rpi-bash-runner.md": "Explains how the Raspberry Pi event runner script works and how to set it up to execute GPIO events.",
  "frontend/docs/rpi-bash-runner.md.backup": "Empty backup file with no content.",
  "frontend/index.css": "Tailwind-based global styling and theme variables plus custom control panel and fullscreen CSS rules.",
  "frontend/index.html": "Basic HTML entrypoint loading the frontend app and main script.",
  "frontend/scripts/linux_bundle_run.sh": "Launcher script that checks dependencies, manages dfx replica lifecycle, and starts the local test bundle.",
  "frontend/scripts/package_linux_bundle.sh": "Builds frontend and backend, collects artifacts, and packages them into a timestamped Linux bundle tar.gz.",
  "frontend/scripts/rpi_event_runner.sh": "Polls a backend canister for events and executes whitelisted GPIO commands on a Raspberry Pi, with optional dry‑run mode.",
  "frontend/scripts/rpi_pin_test.sh": "Provides interactive or automated GPIO pin testing for Raspberry Pi using gpioset, supporting dry‑run mode.",
  "frontend/src/App.tsx": "Root React component that wraps the control panel screen in a dark‑theme provider and includes toast notifications.",
  "frontend/src/components/control-panel/AddControlModal.tsx": "Modal UI for creating new controls with type‑specific settings, validation, and binary code generation.",
  "frontend/src/components/control-panel/ControlLayoutProvider.tsx": "Provides layout state, loads/saves layout via backend actor, validates binary codes, and manages local control creation.",
  "frontend/src/components/control-panel/ControlRenderer.tsx": "Renders different control types and emits validated signal events, handling UI interactions like press, toggle, slider, and radio changes.",
  "frontend/src/components/control-panel/CreateControlButton.tsx": "Provides a button to open the add‑control modal, disabling itself and showing tooltips based on layout and mode state.",
  "frontend/src/components/control-panel/DragController.tsx": "Wraps a control with draggable positioning logic during edit mode and updates layout coordinates on mouse movement.",
  "frontend/src/components/control-panel/FullscreenToggleButton.tsx": "Toggles fullscreen mode with error handling and displays appropriate icons and labels.",
  "frontend/src/components/control-panel/ImportExportPanel.tsx": "Handles exporting the current layout to JSON and importing layouts with validation and error reporting.",
  "frontend/src/components/control-panel/InspectorPanel.tsx": "Displays and edits properties of the selected control, including IDs, binary codes, types, and radio options.",
  "frontend/src/components/control-panel/ModeToggle.tsx": "Switches between edit and interact modes with a single button and icon change.",
  "frontend/src/components/control-panel/RecentSignalsPanel.tsx": "Shows a scrollable list of recently emitted signals with timestamps and allows manual refresh.",
  "frontend/src/components/control-panel/SharedAddControlButton.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/control-panel/UserExtensionsSection.tsx": "Provides a scaffold area for users to add custom UI or logic within a styled card.",
  "frontend/src/components/control-panel/Workspace.tsx": "Renders all controls within a bounded workspace, enabling selection and dragging in edit mode.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useControlLayout.ts": "Provides context access for control layout state and modification methods, ensuring usage within its provider.",
  "frontend/src/hooks/useFullscreen.ts": "Manages fullscreen state for a referenced element with cross-browser support and toggle helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity auth lifecycle, exposing identity, login, logout, and status via React context.",
  "frontend/src/hooks/usePanelMode.ts": "Maintains a global edit/interact panel mode synced to localStorage using a custom external store.",
  "frontend/src/hooks/useRecentSignals.ts": "Fetches recent backend events using the actor, polling periodically and enabling manual refresh.",
  "frontend/src/hooks/useSignalEmitter.ts": "Emits control interaction events through the actor and invalidates recent event queries on success.",
  "frontend/src/index.css": "Defines global Tailwind-based styles, theming variables, fullscreen rules, and custom scrollbars.",
  "frontend/src/lib/binaryCode.ts": "Validates 4‑bit binary codes and deterministically generates one from a string seed.",
  "frontend/src/lib/controlDefaults.ts": "Generates default config values for each control type, including layout and type-specific fields.",
  "frontend/src/lib/download.ts": "Utility for downloading JSON data by creating a temporary blob link.",
  "frontend/src/lib/gpiosetCommands.ts": "Converts 4‑bit binary codes into Raspberry Pi gpioset command strings and sequences.",
  "frontend/src/lib/layoutSerialization.ts": "Validates layout configs, checking control fields and binary codes, and provides JSON import/export helpers.",
  "frontend/src/lib/safeBrowser.ts": "Provides safe wrappers for browser APIs like localStorage, hostname, and fullscreen checks.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and renders the root component.",
  "frontend/src/screens/ControlPanelScreen.tsx": "Defines the main control panel UI layout, including workspace, side panels, mode controls, and fullscreen handling.",
  "frontend/src/types/controlPanel.ts": "Declares TypeScript types for control configurations and layout structures.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme settings, colors, animations, and plugins.",
  "project_state.json": "Tracks project metadata, existing features, and pending requests for the Linux app bundle effort."
}