{
  "backend/main.mo": "Motoko actor defining the backend canister with Event and Control types, layout management, and event logging. Provides query/update methods for saving layouts, emitting button events, and retrieving events with decimal code validation (1-16).",
  "feature_evidence.json": "Feature evidence report documenting two completed features: replacing gpioset commands with HTTP POST requests in ControlRenderer and updating gpioHttp.ts to send decimal code and on/off state payloads.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, hooks, utilities, and type definitions for the GPIO control panel application.",
  "frontend/docs/linux-local-test-bundle.md": "Documentation guide for downloading, extracting, and running the GPIO Control Panel Linux test bundle on Linux systems or Raspberry Pi.",
  "frontend/docs/rpi-bash-runner.md": "Documentation for the Raspberry Pi GPIO event runner script that polls the backend canister and executes GPIO commands locally on hardware.",
  "frontend/docs/rpi-bash-runner.md.backup": "Backup copy of the Raspberry Pi GPIO event runner documentation (empty content).",
  "frontend/index.css": "Tailwind CSS configuration with dark theme color variables, custom control panel styles (control-lit class), fullscreen workspace styling, and custom scrollbar theming.",
  "frontend/index.html": "HTML entry point for the React application with dark theme class and root div mounting point.",
  "frontend/scripts/lib/script_diagnostics.sh": "Bash library providing standardized error reporting and diagnostics for build/deployment scripts with colored output and comprehensive error logging via run_step function.",
  "frontend/scripts/linux_bundle_run.sh": "Launcher script for the Linux test bundle that starts a local IC replica, deploys the control panel application, and provides start/stop/clean commands with diagnostic output.",
  "frontend/scripts/package_linux_bundle.sh": "Packaging script that builds frontend and backend, creates a distributable .tar.gz archive containing all necessary files, launcher scripts, and documentation for Linux deployment.",
  "frontend/scripts/rpi_event_runner.env.example": "Example environment configuration file for the Raspberry Pi GPIO event runner, defining required settings like canister ID, network, and optional parameters like dry-run mode, poll interval, and state file location.",
  "frontend/scripts/rpi_event_runner.service.example": "Example systemd service unit file for running the GPIO event runner as a system service on Raspberry Pi, with configuration for working directory, environment file, restart behavior, and security hardening options.",
  "frontend/scripts/rpi_event_runner.sh": "Bash script that continuously polls the backend canister for GPIO events and executes whitelisted GPIO commands (gpioset) on a Raspberry Pi, with support for dry-run mode, state tracking, and configurable polling intervals.",
  "frontend/scripts/rpi_pin_test.sh": "Standalone GPIO pin verification script for testing Raspberry Pi output pins (26, 6, 22, 4) used by the control panel, supporting interactive and automatic modes with configurable delays and dry-run capability.",
  "frontend/src/App.tsx": "Root React component that sets up the dark theme provider, renders the main ControlPanelScreen, and includes the Toaster for notifications.",
  "frontend/src/components/control-panel/AddControlModal.tsx": "Modal dialog component for creating new controls with configuration options for different control types (button, toggle, slider, radio, dial), including validation, dual code generation, and form state management.",
  "frontend/src/components/control-panel/ControlLayoutProvider.tsx": "React context provider that manages control layout state, handles backend synchronization via React Query, and provides CRUD operations for controls with local state management and optimistic updates.",
  "frontend/src/components/control-panel/ControlRenderer.tsx": "Component that renders interactive controls (buttons, toggles, sliders, radio groups, dials) based on configuration, handles user interactions, generates GPIO commands, and emits signals to the backend while supporting edit mode.",
  "frontend/src/components/control-panel/CreateControlButton.tsx": "Button component that opens the AddControlModal for creating new controls, with tooltip support and disabled state handling based on initialization status and edit mode.",
  "frontend/src/components/control-panel/DragController.tsx": "Wraps control components with drag-and-drop functionality, handling mouse events to update control position and showing selection outline in edit mode.",
  "frontend/src/components/control-panel/FullscreenToggleButton.tsx": "Renders a button to toggle fullscreen mode with appropriate icons (Maximize/Minimize) and error handling via toast notifications.",
  "frontend/src/components/control-panel/ImportExportPanel.tsx": "Provides UI for exporting control layouts to JSON files and importing them with validation error display, disabled in interact mode.",
  "frontend/src/components/control-panel/InspectorPanel.tsx": "Displays and edits properties of the selected control including position, size, type-specific settings (button codes, slider ranges, radio options), and includes import/export functionality.",
  "frontend/src/components/control-panel/ModeToggle.tsx": "Button component that toggles between edit and interact modes with corresponding icons (Edit/Play).",
  "frontend/src/components/control-panel/RecentSignalsPanel.tsx": "Displays a scrollable list of recent control signal events with timestamps, control details, and decimal codes, with refresh capability.",
  "frontend/src/components/control-panel/SharedAddControlButton.tsx": "Empty file placeholder for a shared add control button component.",
  "frontend/src/components/control-panel/UserExtensionsSection.tsx": "Provides a placeholder card section where users can add custom React components and functionality with access to hooks and UI components.",
  "frontend/src/components/control-panel/Workspace.tsx": "Main canvas area that renders all controls with drag controllers, clears selection in interact mode, and shows empty state message.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useControlLayout.ts": "Context definition and hook for accessing control layout state including CRUD operations, validation, save/import functionality, and loading states.",
  "frontend/src/hooks/useFullscreen.ts": "Custom hook managing fullscreen state and operations with cross-browser support, syncing state via fullscreen API events and providing enter/exit/toggle functions.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/usePanelMode.ts": "React hook managing global panel mode state ('edit' or 'interact') with localStorage persistence and cross-component synchronization using useSyncExternalStore.",
  "frontend/src/hooks/useRecentSignals.ts": "React Query hook that fetches recent events from the backend actor, polling every 2 seconds with automatic refetching.",
  "frontend/src/hooks/useSignalEmitter.ts": "React mutation hook that emits control events (button, toggle, slider, etc.) to the backend actor with decimal codes and command strings, invalidating event queries on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom dark theme color variables (OKLCH color space), control panel styling for lit states, vertical sliders, fullscreen workspace, and custom scrollbars.",
  "frontend/src/lib/binaryCode.ts": "Empty file with no content.",
  "frontend/src/lib/buttonCode.ts": "Utilities for validating decimal button codes (1-16), converting between decimal and 4-bit binary representations, and generating deterministic codes from string seeds.",
  "frontend/src/lib/controlDefaults.ts": "Provides default configuration values for different control types (button, toggle, slider, radio, dial) and generates dual decimal codes for controls requiring multiple codes.",
  "frontend/src/lib/download.ts": "Utility function to download JSON data as a file by creating a blob URL and triggering a browser download.",
  "frontend/src/lib/gpioHttp.ts": "Sends GPIO signals via HTTP POST to localhost:3000/gpio with decimal code (1-16) and state ('on' or 'off').",
  "frontend/src/lib/gpiosetCommands.ts": "Generates gpioset shell commands from decimal codes (1-16) by converting to 4-bit binary and mapping to GPIO pins (26, 6, 22, 4), with functions for button press/release and general control interactions.",
  "frontend/src/lib/layoutSerialization.ts": "Provides validation, export, and import functions for control panel layouts, ensuring controls have valid IDs, types, positions, sizes, and decimal codes (1-16) based on control type.",
  "frontend/src/lib/safeBrowser.ts": "Safe wrappers for browser APIs (localStorage, location, fullscreen) that gracefully handle unavailable or blocked APIs without throwing errors during SSR or restricted contexts.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for conditional CSS class name merging.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/screens/ControlPanelScreen.tsx": "Main control panel screen with header, workspace, and conditional sidebars (inspector/extensions in edit mode, signals in interact mode) plus fullscreen support.",
  "frontend/src/types/controlPanel.ts": "TypeScript type definitions for control panel including ControlType, ControlConfig with decimal codes (1-16), RadioOption, and LayoutConfig.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, container settings, border radius variables, and animation keyframes for accordion components.",
  "project_state.json": "Project metadata tracking architectural notes about GPIO HTTP POST implementation, existing features for replacing gpioset commands with HTTP requests to localhost:3000/gpio."
}