{
  "kind": "build_request",
  "title": "Add a dedicated scaffold section for user custom code (frontend + backend)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a new frontend scaffold component file intended for user extensions, with clear TODO markers and a minimal placeholder UI, and export it for use elsewhere in the app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make a new section in the code for me to code the rest in"
        ]
      },
      "acceptanceCriteria": [
        "A new TypeScript React component file exists in the frontend codebase dedicated to user custom code (e.g., a 'UserExtensions'/'CustomSection' component).",
        "The file includes clear comment delimiters (e.g., 'BEGIN USER CODE' / 'END USER CODE') indicating where the user should add code.",
        "The component renders without crashing and shows a simple placeholder (e.g., heading + short description) using existing Tailwind/shadcn styling patterns."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add the new frontend scaffold component into an existing screen so it is visible in the running app (without disrupting existing control panel behavior).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make a new section in the code for me to code the rest in"
        ]
      },
      "acceptanceCriteria": [
        "The Control Panel UI renders the new scaffold section in a sensible location (e.g., in a sidebar panel or below existing panels) and remains fully functional in both Edit and Interact modes.",
        "No existing control creation, layout editing, fullscreen, import/export, or recent signals behavior regresses."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a clearly labeled backend scaffold section in backend/main.mo for future user-defined logic, implemented as at least one harmless placeholder query or shared method returning a static value.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make a new section in the code for me to code the rest in"
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo contains a clearly marked section for user custom code (comment block with TODO markers).",
        "At least one placeholder canister method exists in that section (query or shared) that compiles and returns a static value (e.g., Text) without affecting existing layout/event functionality.",
        "Existing backend methods (getLayout/saveLayout/emitEvent/getRecentEvents/getEventsByControlId) continue to behave as before, including 4-bit binary validation."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (shadcn) directly; only compose them.",
    "Do not edit the immutable frontend hook/bootstrap paths listed in SYSTEM_CONTEXT (e.g., frontend/src/main.tsx, frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration.mo if state schema changes require it."
  ],
  "nonGoals": [
    "Do not implement any new product functionality beyond providing a scaffold/extension area.",
    "Do not redesign the existing control panel UI or change existing control behavior.",
    "Do not add any third-party integrations, external databases, or additional backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}