{
  "kind": "build_request",
  "title": "Send GPIO HTTP POST on button press and reset to 0000 on release",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "When a UI control of type \"button\" is pressed (pointer down or keyboard activation), send an HTTP POST request to http://localhost:3000/gpio with header Content-Type: application/json and a JSON body containing the pressed button’s 4-bit binary code in the form {\"binary\": \"XXXX\"}, where XXXX is the button’s binary code.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "When a button is pressed send a HTTP Post request to http://localhost:3000/gpio with the content of the post being application/json and the value of the body be {\"binary\", \"XXXX\"} where XXXX is the value of the binary code of the button."
        ]
      },
      "acceptanceCriteria": [
        "Pressing a button control triggers a POST to http://localhost:3000/gpio.",
        "The request includes header Content-Type: application/json.",
        "The request body is valid JSON and includes the pressed code as {\"binary\":\"<4-bit code>\"}.",
        "No POST is sent while in edit mode.",
        "If the control’s binary code is invalid, no POST is sent and the existing validation behavior remains (warn/ignore)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "When the same \"button\" press is released (pointer up/cancel/leave, blur while pressed, or keyboard key-up), immediately send an HTTP POST request to http://localhost:3000/gpio with Content-Type: application/json and JSON body {\"binary\":\"0000\"}. Ensure any previously scheduled delayed reset behavior for buttons does not cause an additional, later reset send.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "when the press is released send 0000"
        ]
      },
      "acceptanceCriteria": [
        "Releasing a pressed button (pointer up/cancel/leave) sends a POST with body {\"binary\":\"0000\"} immediately.",
        "Releasing a pressed button via keyboard (Enter/Space key-up) sends a POST with body {\"binary\":\"0000\"} immediately.",
        "If a button loses focus while pressed (blur), the app sends the reset POST exactly once.",
        "No extra delayed reset POST occurs after release (i.e., the previous 1s timeout-based reset behavior for buttons is removed or canceled)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement basic client-side error handling for the GPIO HTTP POST requests: failures must not crash the UI; log a clear console warning/error that includes the endpoint and the binary value that failed to send.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ]
      },
      "acceptanceCriteria": [
        "If http://localhost:3000/gpio is unreachable or returns a network error, the UI continues to function without crashing.",
        "A console warning/error is written on failure that includes the endpoint URL and the attempted binary payload value."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only).",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts/tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Keep the backend as a single Motoko actor; only change backend code if required (this request can be satisfied in the frontend)."
  ],
  "nonGoals": [
    "Do not add third-party auth providers or external database dependencies.",
    "Do not implement WebSockets/real-time messaging for GPIO.",
    "Do not change toggle/dial/radio reset behavior unless explicitly required by the button-press HTTP POST behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}