{
  "kind": "build_request",
  "title": "Newly created controls should immediately appear in the workspace as usable controls",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix control layout state so that creating a control from the “Add Control” modal immediately renders that new control in the Control Panel workspace (instead of only updating state local to the component that triggered creation). Implement a shared control-layout state (e.g., React Context provider) so all control-panel components (Workspace, CreateControlButton/AddControlModal, InspectorPanel, DragController, ControlRenderer, Import/Export) read and mutate the same single source of truth.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "when i create a control make it show up on the control panel as a actual existing button"
        ]
      },
      "acceptanceCriteria": [
        "In Edit mode, clicking “Add Control” -> “Create” adds exactly one new control to the workspace immediately (no refresh needed).",
        "After creation, the newly created control is visible in the workspace and is selected in the Inspector (selection state is shared across the screen).",
        "Dragging a control updates its position in the workspace and the Inspector reflects the same updated values (no desync between components).",
        "Changing a control property in the Inspector immediately updates the rendered control in the workspace (no desync between components).",
        "Import/export and save operations continue to operate on the same shared control list shown in the workspace."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the “Create” action in AddControlModal provides user feedback if control creation fails due to shared-state initialization issues (e.g., provider missing) and add minimal defensive checks so the modal cannot silently succeed without the control appearing in the workspace.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "when i create a control make it show up on the control panel as a actual existing button"
        ]
      },
      "acceptanceCriteria": [
        "If the control cannot be added due to missing/uninitialized shared layout state, the UI shows an English error toast/message and the modal remains open (or otherwise clearly indicates failure).",
        "Under normal conditions, the success toast “Control created” corresponds to the control actually appearing in the workspace immediately."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in frontend/immutablePaths (e.g., frontend/src/hooks/useActor.ts, frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/main.tsx, frontend/src/components/ui/*).",
    "Keep the backend single-actor architecture; no new backend services."
  ],
  "nonGoals": [
    "Changing backend schema/persistence format for layouts (this request is about immediate UI appearance/state sharing).",
    "Adding new control types or changing existing control rendering/interaction behavior beyond what is necessary to make newly created controls appear immediately."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}