{
  "kind": "build_request",
  "title": "Package the project as a downloadable Linux testable app bundle",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a downloadable Linux bundle that lets a user run and test the app locally on a Linux machine with a single command, including the built frontend assets and a launcher script.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "turn this into a Linux app so i can download it and test"
        ]
      },
      "acceptanceCriteria": [
        "A new packaging script exists in the repo (e.g., under a scripts/ directory) that produces a single distributable archive (e.g., .tar.gz) when run on Linux.",
        "The distributable archive contains: (1) the built frontend assets, (2) the compiled canister artifacts needed for local deployment, and (3) a run script (e.g., run.sh) that starts a local replica (if needed) and deploys/serves the app for testing.",
        "Running the included run script on Linux results in the app being accessible for testing (e.g., via a local URL) without requiring the user to manually execute multiple setup commands."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add Linux-specific testing documentation that explains how to download the bundle, prerequisites, how to run the launcher script, and how to troubleshoot common issues.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "turn this into a Linux app so i can download it and test"
        ]
      },
      "acceptanceCriteria": [
        "A new documentation page is added (or an existing doc is extended) describing: required dependencies (e.g., DFX, Node/npm if applicable), how to run the packaged bundle, expected output (URL/ports), and how to stop/reset the local environment.",
        "Documentation is written in English and includes copy-pasteable commands for typical Linux shells (bash)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the packaged Linux bundle includes the Raspberry Pi helper scripts and documentation already present in the project so the user can test both the UI and the GPIO workflow from a single download.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "turn this into a Linux app so i can download it and test"
        ]
      },
      "acceptanceCriteria": [
        "The distributable archive includes the existing Raspberry Pi scripts (frontend/scripts/rpi_event_runner.sh and frontend/scripts/rpi_pin_test.sh) and the related documentation (frontend/docs/rpi-bash-runner.md).",
        "The included documentation in the bundle clearly points to the included scripts’ paths and how to execute them from the extracted directory."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything under frontend/src/components/ui (compose instead of editing).",
    "Do not require third-party auth providers; Internet Identity remains the only supported auth method."
  ],
  "nonGoals": [
    "Creating a true native desktop GUI application using Electron/Tauri or OS-specific installers (e.g., .deb/.rpm) unless explicitly requested later.",
    "Adding new GPIO features beyond packaging and documentation inclusion."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [
      "Download and run the project on Linux for local testing"
    ],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}