{
  "kind": "build_request",
  "title": "Revert Add Control button behavior to last known working state",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Restore the “Add Control” button behavior to the last known working state so that, when the panel is in Edit mode and the control layout is initialized (and not loading), clicking the button reliably opens the Add Control modal (both in the header and in the Import/Export panel “Versions” tab).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "revert the button back to when it worked"
        ]
      },
      "acceptanceCriteria": [
        "When Mode is Edit, the layout is initialized, and the layout is not loading, clicking “Add Control” opens the Add Control modal on the first click.",
        "This behavior is identical for the header button and the Versions-tab button (they both use the shared implementation and behave the same).",
        "If the modal is opened, it stays open until the user closes it or successfully creates a control (it must not immediately close due to guard logic flapping)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Revert/repair the Add Control button’s disabled/loading UX so it matches the last working version: the button is disabled when not allowed to add controls, shows a loading spinner while the layout is loading, and displays a visible tooltip explaining why it is disabled (e.g., runtime mode, initializing, loading).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "revert the button back to when it worked"
        ]
      },
      "acceptanceCriteria": [
        "While the layout is loading, the Add Control button shows a spinner and is not clickable.",
        "When not in Edit mode, the Add Control button is disabled and hovering/focusing it shows a tooltip explaining to switch to Edit mode.",
        "When initialized state is false (initializing), the Add Control button is disabled and hovering/focusing it shows an initializing tooltip message.",
        "The disabled-state tooltip is actually visible/triggerable even when the underlying button is disabled (including in the Versions tab)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose existing UI components instead).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx."
  ],
  "nonGoals": [
    "Changing backend APIs or Motoko state schema.",
    "Redesigning unrelated control panel UI/UX beyond restoring the Add Control button’s prior working behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}