{
  "kind": "build_request",
  "title": "Make the New Tab draft match the in-Caffeine draft",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the \"New Tab\" draft experience so it matches the \"in Caffeine\" draft experience in layout, styling, and behavior (i.e., opening the app in a new browser tab should render the same UI theme, spacing, and component behavior as when viewed inside Caffeine).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "fix the new tab draft to be like the in caffeine draft"
        ]
      },
      "acceptanceCriteria": [
        "When the app is opened in a new browser tab, the UI matches the in-Caffeine draft (same theme colors, typography, spacing, and component styling).",
        "No CSS/Tailwind/theme-related regressions occur only in the new-tab view (e.g., missing styles, different background, different layout sizing/scrolling).",
        "Core interactions continue to work the same in the new-tab view (e.g., edit/runtime mode toggle, adding controls modal, inspector panel in edit mode, recent signals panel, import/export panel)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn components are read-only).",
    "Backend must remain a single Motoko actor in backend/main.mo; introduce backend changes only if required to resolve the new-tab vs in-Caffeine mismatch."
  ],
  "nonGoals": [
    "Adding new product features unrelated to the new-tab draft mismatch.",
    "Changing the radio-group behavior/orientation/logging functionality beyond what is necessary to make the new-tab draft match the in-Caffeine draft."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}