{
  "kind": "build_request",
  "title": "Replace GPIO command execution with HTTP POST requests",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Replace the gpioset command execution in ControlRenderer with HTTP POST requests to http://localhost:3000/gpio. The request payload must include the button decimal code and a value of \"on\" when the button is pressed and \"off\" when the button is released.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "instead of running the gpio command do a post to http://localhost:3000/gpio and make the request payload the button decimal code and value \"on\" when it is pressed and \"off\" when it is released"
        ]
      },
      "acceptanceCriteria": [
        "Button press events send POST request to http://localhost:3000/gpio with payload containing decimal code and value \"on\"",
        "Button release events send POST request to http://localhost:3000/gpio with payload containing decimal code and value \"off\"",
        "The gpioset command execution is completely removed from ControlRenderer",
        "HTTP requests are made using the existing fetch API or similar mechanism"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the gpioHttp.ts utility module to support sending both the decimal code and the on/off state value in the POST request payload to http://localhost:3000/gpio.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ]
      },
      "acceptanceCriteria": [
        "The POST request payload includes both the decimal code (1-16) and the state value (\"on\" or \"off\")",
        "The function accepts parameters for both decimal code and state",
        "Error handling is preserved for failed HTTP requests"
      ]
    }
  ],
  "constraints": [
    "Do not modify backend files",
    "Preserve existing error handling and toast notifications",
    "Maintain the existing control interaction behavior and state management"
  ],
  "nonGoals": [
    "Implementing the HTTP server at localhost:3000/gpio",
    "Modifying the gpioset command generation logic (can remain for logging purposes)",
    "Changing how decimal codes are calculated or assigned to controls"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}