{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "GPIO HTTP POST on button press and immediate reset on release",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Send GPIO HTTP POST with the pressed button's validated 4-bit binary code on button press (pointer down / keyboard activation), disabled in edit mode.",
      "acceptanceCriteria": [
        "Pressing a button control triggers a POST to http://localhost:3000/gpio.",
        "The request includes header Content-Type: application/json.",
        "The request body is valid JSON and includes the pressed code as {\"binary\":\"<4-bit code>\"}.",
        "No POST is sent while in edit mode.",
        "If the control’s binary code is invalid, no POST is sent and the existing validation behavior remains (warn/ignore)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/gpioHttp.ts",
          "operation": "create",
          "description": "Add a small fetch-based helper to POST JSON to http://localhost:3000/gpio with Content-Type: application/json and body {\"binary\":\"XXXX\"}, intended for button-press signaling."
        },
        {
          "path": "frontend/src/components/control-panel/ControlRenderer.tsx",
          "operation": "modify",
          "description": "Update the button control interaction logic to call the new GPIO POST helper on press (pointer down and keyboard activation) only when not in edit mode and only when validateBinaryCode(control.binaryCode) passes; keep existing warn/ignore validation behavior unchanged."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "On button release (pointer up/cancel/leave, blur while pressed, or keyboard key-up), immediately POST a reset payload {\"binary\":\"0000\"} exactly once and cancel/remove any delayed reset behavior.",
      "acceptanceCriteria": [
        "Releasing a pressed button (pointer up/cancel/leave) sends a POST with body {\"binary\":\"0000\"} immediately.",
        "Releasing a pressed button via keyboard (Enter/Space key-up) sends a POST with body {\"binary\":\"0000\"} immediately.",
        "If a button loses focus while pressed (blur), the app sends the reset POST exactly once.",
        "No extra delayed reset POST occurs after release (i.e., the previous 1s timeout-based reset behavior for buttons is removed or canceled)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/control-panel/ControlRenderer.tsx",
          "operation": "modify",
          "description": "Revise button release handling to POST {\"binary\":\"0000\"} immediately on pointer up/cancel/leave, blur-while-pressed, and Enter/Space key-up; ensure the reset send is de-duplicated (sent exactly once per press) and remove/cancel the prior 1s timeout-based reset behavior for buttons so no later reset fires after release."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add non-crashing client-side error handling for GPIO POST failures with clear console logging including URL and binary value.",
      "acceptanceCriteria": [
        "If http://localhost:3000/gpio is unreachable or returns a network error, the UI continues to function without crashing.",
        "A console warning/error is written on failure that includes the endpoint URL and the attempted binary payload value."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/gpioHttp.ts",
          "operation": "modify",
          "description": "Implement robust error handling in the GPIO POST helper: catch fetch/network errors and handle non-success HTTP responses without throwing into the UI event handler; log a clear console warning/error that includes the URL http://localhost:3000/gpio and the binary value that failed to send."
        },
        {
          "path": "frontend/src/components/control-panel/ControlRenderer.tsx",
          "operation": "modify",
          "description": "Call the GPIO POST helper from button press/release paths in a way that cannot crash rendering (e.g., fire-and-forget or safely handled async) while relying on the helper's console logging for failures."
        }
      ]
    }
  ]
}