{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Runtime pointer-based button presses and enhanced event logging (binary code + button name)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make runtime-mode button presses work reliably with both mouse and touch via Pointer Events, while preserving edit-mode no-signal behavior and preventing stuck pressed state.",
      "acceptanceCriteria": [
        "In runtime mode, pressing a button with a mouse triggers the press behavior.",
        "In runtime mode, tapping a button on a touch screen triggers the press behavior.",
        "The interaction does not get stuck in a pressed state when the pointer leaves/cancels (e.g., pointercancel/leave is handled).",
        "In edit mode, button presses do not emit signals (existing behavior preserved)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/control-panel/ControlRenderer.tsx",
          "operation": "modify",
          "description": "Update the button control interaction handling to use Pointer Events (e.g., onPointerDown/onPointerUp/onPointerCancel/onPointerLeave) so both mouse and touch reliably trigger presses in runtime mode, and ensure pressed UI state is always cleared on leave/cancel to prevent stuck-pressed behavior. Keep existing edit-mode gating so no signals are emitted in edit mode."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Include button name (control label) along with binary code when emitting runtime-mode button press events from the frontend so recent-events queries can return both fields.",
      "acceptanceCriteria": [
        "Backend event records include the button name (label) along with binaryCode for button press events.",
        "Frontend emits button press events with both binaryCode and button name (label) included.",
        "Recent events fetched from the backend include the binary code and button name for button press events."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSignalEmitter.ts",
          "operation": "modify",
          "description": "Update the signal emission mutation to pass controlName (control label) into the backend emitEvent call using the existing backend interface signature, while preserving existing React Query invalidation behavior."
        },
        {
          "path": "frontend/src/components/control-panel/ControlRenderer.tsx",
          "operation": "modify",
          "description": "When emitting runtime-mode events for button presses (and any other control emissions needed for schema compatibility), include the control's label as controlName so emitted events contain both binaryCode and the button name (label)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Display the button name (label) alongside binary code in the Recent Signals UI for logged button press events, and remain resilient to missing/optional fields.",
      "acceptanceCriteria": [
        "The Recent Signals list shows the binary code and the button name (label) for button press events.",
        "The Recent Signals panel continues to render without errors after the backend event shape/API changes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/control-panel/RecentSignalsPanel.tsx",
          "operation": "modify",
          "description": "Update rendering of recent events to show event.controlName (label) alongside event.binaryCode (with a safe fallback when controlName is missing), ensuring the panel continues to render without errors when optional fields are absent."
        }
      ]
    }
  ]
}