{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore Add Control modal open/disabled behavior",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix shared Add Control button so it reliably opens the Add Control modal in Edit mode when layout is initialized and not loading, without the modal auto-closing due to guard-state changes.",
      "acceptanceCriteria": [
        "When Mode is Edit, the layout is initialized, and the layout is not loading, clicking “Add Control” opens the Add Control modal on the first click.",
        "This behavior is identical for the header button and the Versions-tab button (they both use the shared implementation and behave the same).",
        "If the modal is opened, it stays open until the user closes it or successfully creates a control (it must not immediately close due to guard logic flapping)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/control-panel/SharedAddControlButton.tsx",
          "operation": "modify",
          "description": "Revert/repair modal open-state handling by removing the effect that auto-closes the modal when canAddControl flips false after opening; keep guard logic only for whether the click can open the modal so the modal stays open until user closes it or creation succeeds. Ensure both header and Versions-tab usage continue to share this exact implementation. Use existing shadcn-ui Tooltip/Dialog/Button components already imported (Verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Restore Add Control button disabled/loading UX with spinner during layout loading and a visible tooltip explaining disabled reasons, including when the button is disabled.",
      "acceptanceCriteria": [
        "While the layout is loading, the Add Control button shows a spinner and is not clickable.",
        "When not in Edit mode, the Add Control button is disabled and hovering/focusing it shows a tooltip explaining to switch to Edit mode.",
        "When initialized state is false (initializing), the Add Control button is disabled and hovering/focusing it shows an initializing tooltip message.",
        "The disabled-state tooltip is actually visible/triggerable even when the underlying button is disabled (including in the Versions tab)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/control-panel/SharedAddControlButton.tsx",
          "operation": "modify",
          "description": "Adjust disabled/loading rendering so the spinner is shown when layout is loading, the button remains non-clickable while loading/disabled, and the tooltip remains triggerable even when the underlying button is disabled by moving the TooltipTrigger target to a focusable wrapper (e.g., wrapper span with appropriate focus/aria-disabled) for both hover and keyboard focus. Use existing shadcn-ui Tooltip components already referenced (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/components/control-panel/ImportExportPanel.tsx",
          "operation": "modify",
          "description": "Confirm the Versions tab continues to use SharedAddControlButton directly (no local overrides) so the restored disabled/loading/tooltip behavior is identical to the header button. If any layout-specific wrapper/styling interferes with tooltip triggering, adjust only composition/styling here without modifying files under frontend/src/components/ui (Verify the component's usage instructions before implementing)."
        }
      ]
    }
  ]
}