{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Unify New Tab vs in-Caffeine draft theming and layout rendering",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the app renders identical theme, spacing, and control-panel behavior when opened in a standalone browser tab versus embedded inside Caffeine by unifying global CSS sources and root layout sizing/scroll handling.",
      "acceptanceCriteria": [
        "When the app is opened in a new browser tab, the UI matches the in-Caffeine draft (same theme colors, typography, spacing, and component styling).",
        "No CSS/Tailwind/theme-related regressions occur only in the new-tab view (e.g., missing styles, different background, different layout sizing/scrolling).",
        "Core interactions continue to work the same in the new-tab view (e.g., edit/runtime mode toggle, adding controls modal, inspector panel in edit mode, recent signals panel, import/export panel)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "Remove divergence between the root-level stylesheet and the app stylesheet by making frontend/index.css delegate to (or exactly mirror) frontend/src/index.css so any host (including Caffeine) loading the root stylesheet gets the same Tailwind theme variables, base styles, and control-panel-specific rules."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Harden global base styling so both embedded and standalone contexts compute the same layout: ensure html/body/#root height and overflow expectations are explicitly defined, preserve the intended dark theme variables, and keep control-panel-specific styles (fullscreen region + scrollbars) consistent across hosting contexts."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Align document-level defaults between new-tab and embedded rendering by setting consistent root element attributes (e.g., default dark theme class for first paint if needed), and ensure the HTML/body/root container sizing/margins do not cause spacing or scrolling differences between environments."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify the root app wrapper applies the same background/text classes and minimum height behavior in all contexts; adjust only the top-level wrapper (not shadcn components under frontend/src/components/ui) to prevent new-tab-only layout/theme drift."
        }
      ]
    }
  ]
}