{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Constrain binary codes to 4-bit values across the app",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make binary code validation strictly require exactly 4 bits and return only user-facing English errors.",
      "acceptanceCriteria": [
        "validateBinaryCode rejects empty input.",
        "validateBinaryCode rejects any input containing characters other than 0 or 1.",
        "validateBinaryCode rejects any input not exactly 4 characters long.",
        "validateBinaryCode accepts only strings matching /^[01]{4}$/.",
        "All returned validation error strings are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/binaryCode.ts",
          "operation": "modify",
          "description": "Update validateBinaryCode to enforce exactly 4 characters of only 0/1 (strict /^[01]{4}$/) and ensure all returned error messages are clear, user-facing English."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Generate deterministic 4-bit default binary codes everywhere new controls/options are created.",
      "acceptanceCriteria": [
        "Newly created controls default to a 4-bit binary code.",
        "Newly added radio options default to a 4-bit binary code.",
        "No part of the UI generates or auto-fills 8-bit binary codes anymore."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/binaryCode.ts",
          "operation": "modify",
          "description": "Change generateDefaultBinaryCode to return deterministic 4-bit binary strings (e.g., modulo 16 and padStart(4, '0')) and ensure no 8-bit generation remains."
        },
        {
          "path": "frontend/src/components/control-panel/ControlLayoutProvider.tsx",
          "operation": "modify",
          "description": "Ensure any default/derived binary codes produced when creating controls and when deriving radio option binary codes during layout deserialization use the 4-bit generator (and remove any 8-bit assumptions)."
        },
        {
          "path": "frontend/src/components/control-panel/AddControlModal.tsx",
          "operation": "modify",
          "description": "Update default/reset values and any placeholder text so new controls and newly added radio options start with 4-bit binary codes (and remove any 8-bit examples)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Limit all binary code inputs to 4 characters and prevent persisting non-4-bit binary codes via create/update/import.",
      "acceptanceCriteria": [
        "In the Add Control modal, the Binary Code input prevents entry beyond 4 characters.",
        "In the Inspector panel, the Binary Code input prevents entry beyond 4 characters.",
        "For radio controls, each Radio Option Binary Code input prevents entry beyond 4 characters.",
        "Users cannot persist (create/update/import) a layout containing binary codes that are not exactly 4 bits."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/control-panel/AddControlModal.tsx",
          "operation": "modify",
          "description": "Constrain Binary Code and Radio Option Binary Code inputs to max 4 characters (e.g., maxLength=4) and sanitize input to only allow 0/1 while typing; keep create submission blocked by strict validation errors."
        },
        {
          "path": "frontend/src/components/control-panel/InspectorPanel.tsx",
          "operation": "modify",
          "description": "Constrain control Binary Code and radio option Binary Code inputs to max 4 characters and sanitize to 0/1; adjust editing flow to avoid spamming strict validation errors on every keystroke while still preventing invalid values from being saved."
        },
        {
          "path": "frontend/src/components/control-panel/ControlLayoutProvider.tsx",
          "operation": "modify",
          "description": "Add a pre-save and pre-apply-import guard that validates all control.binaryCode and radioOptions[].binaryCode with strict 4-bit validation; if invalid, show an English error and do not call persistence (saveLayout/applyImportedLayout)."
        },
        {
          "path": "frontend/src/components/control-panel/ImportExportPanel.tsx",
          "operation": "modify",
          "description": "Ensure import UX clearly reports binary code validation failures (English) and that imported layouts only apply when validation succeeds (no persistence of invalid codes)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Enforce 4-bit binary code constraint during layout import validation with clear field-level errors.",
      "acceptanceCriteria": [
        "Importing a layout with any control binaryCode not exactly 4 bits returns validation errors for the offending fields.",
        "Importing a layout with any radio option binaryCode not exactly 4 bits returns validation errors for the offending fields.",
        "Importing a valid layout with only 4-bit binary codes succeeds."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/layoutSerialization.ts",
          "operation": "modify",
          "description": "Rely on the updated strict 4-bit validateBinaryCode for import validation; ensure returned ValidationError messages remain clear English and include accurate field paths for control and radio option binaryCode fields."
        }
      ]
    }
  ]
}