{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Shared Control Layout State for Immediate Workspace Rendering",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Introduce a single shared control-layout + selection state for the whole Control Panel so newly created controls render immediately and all panels stay in sync.",
      "acceptanceCriteria": [
        "In Edit mode, clicking “Add Control” -> “Create” adds exactly one new control to the workspace immediately (no refresh needed).",
        "After creation, the newly created control is visible in the workspace and is selected in the Inspector (selection state is shared across the screen).",
        "Dragging a control updates its position in the workspace and the Inspector reflects the same updated values (no desync between components).",
        "Changing a control property in the Inspector immediately updates the rendered control in the workspace (no desync between components).",
        "Import/export and save operations continue to operate on the same shared control list shown in the workspace."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useControlLayout.ts",
          "operation": "modify",
          "description": "Refactor the control layout hook into a shared-state solution by introducing a React Context + Provider that owns the single control list, selection state, and mutators (create/update/delete/save/import). Ensure all consumers read/write the same in-memory state instance rather than creating independent hook instances."
        },
        {
          "path": "frontend/src/screens/ControlPanelScreen.tsx",
          "operation": "modify",
          "description": "Wrap the Control Panel UI with the new ControlLayoutProvider so Workspace, CreateControlButton/AddControlModal, InspectorPanel, DragController, ControlRenderer, and ImportExportPanel all consume the same shared layout + selection state."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add defensive checks and user-visible error feedback when control creation cannot update shared layout state (e.g., provider missing/uninitialized) so creation never silently 'succeeds'.",
      "acceptanceCriteria": [
        "If the control cannot be added due to missing/uninitialized shared layout state, the UI shows an English error toast/message and the modal remains open (or otherwise clearly indicates failure).",
        "Under normal conditions, the success toast “Control created” corresponds to the control actually appearing in the workspace immediately."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/control-panel/AddControlModal.tsx",
          "operation": "modify",
          "description": "Adjust the Create flow so the modal only closes on confirmed success: make onCreateControl return a success boolean (or promise) and keep the modal open + display an error message/toast when creation fails (e.g., shared state not initialized)."
        },
        {
          "path": "frontend/src/components/control-panel/CreateControlButton.tsx",
          "operation": "modify",
          "description": "Implement guarded creation: detect missing/uninitialized shared control-layout state before attempting creation, show an English error toast when unavailable, and only show the “Control created” success toast when the shared state was updated (so the new control will render immediately in the workspace)."
        },
        {
          "path": "frontend/src/hooks/useControlLayout.ts",
          "operation": "modify",
          "description": "Provide minimal defensive behavior for missing/uninitialized provider scenarios (e.g., expose an initialization flag and/or safe no-op/guarded mutators that surface errors), enabling the modal/button to prevent silent success when the shared layout cannot be mutated."
        }
      ]
    }
  ]
}