{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace GPIO command execution with HTTP POST requests",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace gpioset command execution in ControlRenderer with HTTP POST requests to localhost:3000/gpio, sending decimal code and on/off state",
      "acceptanceCriteria": [
        "Button press events send POST request to http://localhost:3000/gpio with payload containing decimal code and value \"on\"",
        "Button release events send POST request to http://localhost:3000/gpio with payload containing decimal code and value \"off\"",
        "The gpioset command execution is completely removed from ControlRenderer",
        "HTTP requests are made using the existing fetch API or similar mechanism"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/control-panel/ControlRenderer.tsx",
          "operation": "modify",
          "description": "Replace gpioset command execution logic with HTTP POST requests to http://localhost:3000/gpio. For button press events, call the updated gpioHttp utility with the control's decimal code and state \"on\". For button release events, call it with state \"off\". Remove any command execution code while preserving existing error handling, toast notifications, and control interaction behavior."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update gpioHttp.ts utility to send both decimal code and on/off state in POST request payload",
      "acceptanceCriteria": [
        "The POST request payload includes both the decimal code (1-16) and the state value (\"on\" or \"off\")",
        "The function accepts parameters for both decimal code and state",
        "Error handling is preserved for failed HTTP requests"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/gpioHttp.ts",
          "operation": "modify",
          "description": "Update the HTTP POST function to accept both a decimal code parameter and a state parameter (\"on\" or \"off\"). Modify the request payload structure to include both values when sending to http://localhost:3000/gpio. Maintain existing error handling for failed HTTP requests."
        }
      ]
    }
  ]
}