{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend user extension scaffold section",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a dedicated frontend scaffold React component for user custom code with clear TODO markers and placeholder UI.",
      "acceptanceCriteria": [
        "A new TypeScript React component file exists in the frontend codebase dedicated to user custom code (e.g., a 'UserExtensions'/'CustomSection' component).",
        "The file includes clear comment delimiters (e.g., 'BEGIN USER CODE' / 'END USER CODE') indicating where the user should add code.",
        "The component renders without crashing and shows a simple placeholder (e.g., heading + short description) using existing Tailwind/shadcn styling patterns."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/control-panel/UserExtensionsSection.tsx",
          "operation": "create",
          "description": "Create an exported scaffold component (e.g., `UserExtensionsSection`) containing clearly labeled comment delimiters (BEGIN USER CODE / END USER CODE) and a minimal placeholder UI. Use the shadcn-ui Card (and related subcomponents) to match existing panel styling patterns; compose from existing UI components without modifying files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Render the new scaffold component inside the existing Control Panel screen without changing existing behavior in Edit/Interact modes.",
      "acceptanceCriteria": [
        "The Control Panel UI renders the new scaffold section in a sensible location (e.g., in a sidebar panel or below existing panels) and remains fully functional in both Edit and Interact modes.",
        "No existing control creation, layout editing, fullscreen, import/export, or recent signals behavior regresses."
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/ControlPanelScreen.tsx",
          "operation": "modify",
          "description": "Wire `UserExtensionsSection` into the Control Panel UI (e.g., in the right sidebar stack near existing panels) so it is visible in both Edit and Interact modes, while preserving all current mode-conditional rendering and behaviors (create control button, fullscreen toggle, import/export visibility, recent signals polling). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}